# sem3

Задача 1.

# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.

# Пример:

# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# number = int(input('Введите размер списка '))
# list = []
# sum = 0
# for i in range(number):
# list_number = int(input(f'Введите число {i+1} '))
# list.append(list_number)
# if i % 2 != 0:
# sum += list[i]


# print(list)
# print(f'Сумма нечетных чисел равна {sum}')

#Задача 2.

# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]



#x = input().split()
#for i in range(len(x)):
#    x[i] = int(x[i])
#    count = x[0:2]
#   result = map(sum, (count, count1))

#print(list(result))


#Задача 3.
# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

# Пример:

# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

#lst = [1.1, 1.2, 3.1, 5, 10.01]
#new_lst = [round(i%1,2) for i in lst]
#print(lst, '=>', max(new_lst) - min(new_lst))

#Задача 4.
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

# Пример:

# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

#a = int(input())
#f = bin(a)
#print(f)


#a = int(input('Введите число '))
#b = ''
#while a > 0:
#    b = str(a%2) + b
#   a = a // 2
#print(b)


#Задача 5.
# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.

# Пример:

# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]


n = int(input('Введите размер числа Фибоначчи '))
if n < 0: n = n*-1
f1 = f2 = 1
list1 = [f1, f2]
for i in range(2, n):
    f1,f2 = f2, f1 + f2
    list1.append(f2)
print(list1)
f1=f2=1
for i in range(-n, 1):
    f1,f2 = f2, f1 - f2
    list1.insert(0, f2)
print(list1)
